read_verilog hdl/ksa_cells.v 
read_verilog hdl/ksa_16bit.v

hierarchy -check -top ksa_16bit

proc; opt; fsm; opt; 

techmap; opt; abc; opt

#clean

write_verilog ksa_gatelevel.v

stat
