read_verilog hdl/rca_alu_slice.v 
read_verilog hdl/rca_alu_top.v

hierarchy -check -top rca_alu_top

proc; opt; fsm; opt; share; opt;

techmap; opt; abc; opt

clean

write_verilog rca_gatelevel.v

stat
